package by.epam.lis.basic;
//Вывести на экран соответствий между символами и их численными обозначениями в памяти
//   компьютера.Вывести на экран соответствий между символами и их численными обозначениями в памяти
//   компьютера.
public class Main16 {
    public static void main( String []args) {
        for (int i = 33; i <= 122; i++) {
            System.out.println("dec " + i + " symbol " + (char)i);
        }
    }
    }

